kyungjae-lee/stm32-mcu-custom-bootloader/workspace/stm32f407xx_bootloader/Core/Src/main.c
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
} /* End of Bootloader_GetCID_Cmd_Handler */

/**
 * Bootloader_GetRDP_Cmd_Handler()
 * Brief	: Handles BL_GET_RDP command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_GET_RDP command is used to read the Flash Protection (RDP)
 *			  Level.
 */
void Bootloader_GetRDP_Cmd_Handler(uint8_t *pBLRxBuffer)
{
	uint8_t rdpLevel = 0x00;
	Print_Msg("BL_DEBUG_MSG: Bootloader_GetRDP_Cmd_Handler()\n");

	/* Total length of the command packet */
	uint32_t cmdPacketLen = pBLRxBuffer[0] + 1;
	
	/* Extract the CRC32 sent by the host */
	uint32_t crcHost = *((uint32_t *)(pBLRxBuffer + cmdPacketLen - 4));

	if (!Bootloader_Verify_CRC(&pBLRxBuffer[0], cmdPacketLen - 4, crcHost))
	{
		/* Checksum is correct */
		Print_Msg("BL_DEBUG_MSG: Checksum verification success!\n");
		
		/* Send ACK */
		Bootloader_Tx_ACK(pBLRxBuffer[0], 1);
		
		rdpLevel = Get_Flash_RDP_Level();
		Print_Msg("BL_DEBUG_MSG: RDP level: %d %#x\n", rdpLevel, rdpLevel);
		
		/* Send response to the host */
		Bootloader_UART_Write_Data(&rdpLevel, 1);
	}
	else
	{
		/* Checksum is not correct */
		Print_Msg("BL_DEBUG_MSG: Checksum vrification fail!\n");
		
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
} /* End of Bootloader_GetRDP_Cmd_Handler */

/**
 * Bootloader_GoToAddr_Cmd_Handler()
 * Brief	: Handles BL_GO_TO_ADDR command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_GO_TO_ADDR command is used to jump bootloader to specified 
 *			  address.
 *			  A good way to test this functionality is to set the target 
 *			  address to the reset handler of the user application and see if
 *			  the program successfully jumps to the user application. (Reset 
 *			  handler is the entry point to the user application)
 *			  When entering the target address to the host application, 
 *			  make sure to account for the T-bit setting. For example, 
 *			  If the address of the user application's reset handler is 
 *			  0x08008229, then enter 0x08008228.
 */
void Bootloader_GoToAddr_Cmd_Handler(uint8_t *pBLRxBuffer)
{
	uint32_t targetAddr = 0;
	uint8_t addrValid = ADDR_VALID;
	uint8_t addrInvalid = ADDR_INVALID;
	
	Print_Msg("BL_DEBUG_MSG: Bootloader_GoToAddr_Cmd_Handler\n");
	
	/* Total length of the command packet */
	uint32_t cmdPacketLen = pBLRxBuffer[0] + 1;
	
	/* Extract the CRC32 sent by the host */
	uint32_t crcHost = *((uint32_t *)(pBLRxBuffer + cmdPacketLen - 4));

	if (!Bootloader_Verify_CRC(&pBLRxBuffer[0], cmdPacketLen - 4, crcHost))
	{
		/* Checksum is correct */
		Print_Msg("BL_DEBUG_MSG: Checksum verification success!\n");
		
		/* Send ACK */
		Bootloader_Tx_ACK(pBLRxBuffer[0], 1);
		
		targetAddr = *((uint32_t *)&pBLRxBuffer[2]);
		Print_Msg("BL_DEBUG_MSG: Target address to jump to: %#x\n", targetAddr);
		
		if (Verify_Addr(targetAddr) == ADDR_VALID)
		{
			/* Notify the host that the address is valid */
			Bootloader_UART_Write_Data(&addrValid, 1);
			
			/* Jump to addr.
			 * Not executing the following line will trigger the hardfault
			 * exception for ARM Cortex-M processors.
			 * https://www.youtube.com/watch?v=VX_12SjnNhY
			 */
			targetAddr += 1;	/* Set T-bit to 1 */
			
			void (*jumpToTargetAddr)(void) = (void *)targetAddr;
			
			Print_Msg("BL_DEBUG_MSG: Jumping to the target address\n");
			
			jumpToTargetAddr();
		}
		else
		{
			Print_Msg("BL_DEBUG_MSG: Invalid target address\n");
			Bootloader_UART_Write_Data(&addrInvalid, 1);
		}
	}
	else
	{
		/* Checksum is not correct */
		Print_Msg("BL_DEBUG_MSG: Checksum vrification fail!\n");
		
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
} /* End of Bootloader_GoToAddr_Cmd_Handler */

/**
 * Bootloader_EraseFlash_Cmd_Handler()
 * Brief	: Handles BL_ERASE_FLASH command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_ERASE_FLASH command is used to mass-erase or sector-erase the
 *			  user Flash. Erasing a byte of memory space means setting it to 0xFF.
 *			  Check out the 'Erase and program operations' section of the MCU 
 *			  reference manual for more details about sector-erase and mass-erase.
 *			  This function will use Flash driver APIs to implement the erasing 
 *			  functionality. (stn32f4xx_hal_flash_ex.c)
 */
void Bootloader_EraseFlash_Cmd_Handler(uint8_t *pBLRxBuffer)
{
	uint8_t eraseStatus = 0x00;
	Print_Msg("BL_DEBUG_MSG: Bootloader_EraseFlash_Cmd_Handler()\n");
	
	/* Total length of the command packet */
	uint32_t cmdPacketLen = pBLRxBuffer[0] + 1;
	
	/* Extract the CRC32 sent by the host */
	uint32_t crcHost = *((uint32_t *)(pBLRxBuffer + cmdPacketLen - 4));

	if (!Bootloader_Verify_CRC(&pBLRxBuffer[0], cmdPacketLen - 4, crcHost))
	{
		/* Checksum is correct */
		Print_Msg("BL_DEBUG_MSG: Checksum verification success!\n");
		
		/* Send ACK */
		Bootloader_Tx_ACK(pBLRxBuffer[0], 1);
		Print_Msg("BL_DEBUG_MSG: Initial sector: %d, number of sectors: %d\n", pBLRxBuffer[2], pBLRxBuffer[3]);
		
		/* Configure an on-board LED to turn on when the erase operation begins,
		 * and turn off when the operation ends.
		 */
		HAL_GPIO_WritePin(LD4_GPIO_PORT, LD4_Pin, 1);
		eraseStatus = Execute_Flash_Erase(pBLRxBuffer[2], pBLRxBuffer[3]);
		HAL_GPIO_WritePin(LD4_GPIO_PORT, LD4_Pin, 0);

		Print_Msg("BL_DEBUG_MSG: Flash erase status: %#x\n", eraseStatus);
		
		/* Send response to the host */
		Bootloader_UART_Write_Data(&eraseStatus, 1);
	}
	else
	{
		/* Checksum is not correct */
		Print_Msg("BL_DEBUG_MSG: Checksum vrification fail!\n");
		
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
} /* End of Bootloader_EraseFlash_Cmd_Handler */

/**
 * Bootloader_WriteMem_Cmd_Handler()
 * Brief	: Handles BL_WRITE_MEM command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_WRITE_MEM command is used to write data into different memories
 *			  of the MCU.
 */
void Bootloader_WriteMem_Cmd_Handler(uint8_t *pBLRxBuffer)
{
} /* End of Bootloader_WriteMem_Cmd_Handler */

/**
 * Bootloader_EnDisRWProtect_Cmd_Handler()
 * Brief	: Handles BL_ENDIS_RW_PROTECT command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_ENDIS_RW_PROTECT command is used to enable read/write protection on
 *			  different sectors of the user Flash.
 */
void Bootloader_EnDisRWProtect_Cmd_Handler(uint8_t *pBLRxBuffer)
{
} /* End of Bootloader_EnDisRWProtect_Cmd_Handler */

/**
 * Bootloader_ReadMem_Cmd_Handler()
 * Brief	: Handles BL_READ_MEM command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_WRITE_MEM command is used to read data from different memories of
 * 			  the MCU.
 */
void Bootloader_ReadMem_Cmd_Handler(uint8_t *pBLRxBuffer)
{
} /* End of Bootloader_ReadMem_Cmd_Handler */

/**
 * Bootloader_ReadProtectStatus_Cmd_Handler()
 * Brief	: Handles BL_READ_PROTECT_STATUS command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_READ_PROTECT_STATUS command is used to read the protection status
 *			  of all the sectors of the user Flash memory.
 */
void Bootloader_ReadProtectStatus_Cmd_Handler(uint8_t *pBLRxBuffer)
{
} /* End of Bootloader_ReadProtectStatus_Cmd_Handler */

/**
 * Bootloader_ReadOTP_Cmd_Handler()
 * Brief	: Handles BL_READ_OTP command
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * Retval	: None
 * Note		: BL_READ_OTP command is used to read the OTP contents
 */
void Bootloader_ReadOTP_Cmd_Handler(uint8_t *pBLRxBuffer)
{
} /* End of Bootloader_ReadOTP_Cmd_Handler */


