kyungjae-lee/stm32-mcu-custom-bootloader/workspace/stm32f407xx_bootloader/Core/Src/main.c
/* Implementation of the bootloader helper functions -------------------------*/

/**
 * Bootloader_Tx_ACK()
 * Brief	: Sends ACK message to the host
 * Param	: @cmdCode - Command code received from the host
 *			: @lenToFollow - Length of the subsequent data bytes
 * Retval	: None
 */
void Bootloader_Tx_ACK(uint8_t cmdCode, uint8_t lenToFollow)
{
	/* ACKing incorporates 2 bytes; ACK , length to follow */
	uint8_t ackBuf[2];
	ackBuf[0] = BL_ACK;
	ackBuf[1] = lenToFollow;
	HAL_UART_Transmit(C_UART, ackBuf, 2, HAL_MAX_DELAY);
} /* End of Bootloader_Tx_ACK */

/**
 * Bootloader_Tx_NACK()
 * Brief	: Sends NACK message to the host
 * Param	: None
 * Retval	: None
 */
void Bootloader_Tx_NACK(void)
{
	/* NACKing incorporates 1 byte */
	uint8_t nack = BL_NACK;
	HAL_UART_Transmit(C_UART, &nack, 1, HAL_MAX_DELAY);
} /* End of Bootloader_Tx_NACK */

/**
 * Bootloader_Verify_CRC()
 * Brief	: Verifies the CRC of the given buffer in data
 * Param	: @pPacket - Pointer to the data for which the CRC has to be calculated
 *			: @len - Length for which the CRC has to be calculated
 *			: @crcHost - 32-bit crc value sent by the host
 * Retval	: 0 if CRC verification was successful, 1 otherwise.
 */
uint8_t Bootloader_Verify_CRC(uint8_t *pPacket, uint32_t len, uint32_t crcHost)
{
	uint32_t crc = 0xFF;
	
	for (uint32_t i = 0; i < len; i++)
	{
		uint32_t dataByte = pPacket[i];
		crc = HAL_CRC_Accumulate(&hcrc, &dataByte, 1);
	}
	/* Reset CRC Calculation unit.
	 * Without this, all CRC checks following the very first wone will fail.
	 */
	__HAL_CRC_DR_RESET(&hcrc);
		
	if (crc == crcHost)
	{
		return CRC_VERIFICATION_SUCCESS;
	}
	
	return CRC_VERIFICATION_FAIL;
} /* End of Bootloader_Verify_CRC */

/**
 * Bootloader_UART_Write_Data()
 * Brief	: Writes data to C_UART
 * Param	: @pBLRxBuffer - Pointer to the bootloader's Rx buffer
 *			: @len - Length of data to write
 * Retval	: None
 * Note		: This function is a wrapper function for 'HAL_UART_Transmit()'
 */
void Bootloader_UART_Write_Data(uint8_t *pBuffer, uint32_t len)
{
	HAL_UART_Transmit(C_UART, pBuffer, len, HAL_MAX_DELAY);
} /* End of Bootloader_UART_Write_Data */

/**
 * Get_Bootloader_Version()
 * Brief	: Returns the bootloader version macro value
 * Param	: None
 * Retval	: Bootloader version macro value
 */
uint8_t Get_Bootloader_Version(void)
{
	return (uint8_t)BL_VERSION;
} /* End of Get_Bootloader_Version */

/**
 * Get_MCU_Chip_ID()
 * Brief	: Returns the chip (or device) identifier
 * Param	: None
 * Retval	: 16-bit MCU chip identification number
 * Note		: For more information, see the "MCU device ID code" section of the
 *			  MCU reference manual. (DBGMCU_IDCODE; Address: 0xE0042000)
 *			  - Bit[31:16] - Revision identifier (REV_ID)
 *			  - Bit[11:0] - Device identifier (DEV_ID) - 0x413
 */
uint16_t Get_MCU_Chip_ID(void)
{
	return (uint16_t)(DBGMCU->IDCODE) & 0x0FFF;
} /* End of Get_MCU_Chip_ID */

/**
 * Get_Flash_RDP_Level()
 * Brief	: Returns the Flash memory RDP (Read Protection) level
 * Param	: None
 * Retval	: 8-bit RDP level
 * Note		: For more information, see the "Option Bytes" section of the MCU
 *			  reference manual.
 *			  Additional functions can be defined to handle RDP level change.
 */
uint8_t Get_Flash_RDP_Level(void)
{
	uint8_t rdpStatus = 0;
#if 0
	/* The following code shows how to use the APIs provided by the Flash driver
	 * of the ST hardware abstraction layer to achieve reading the RDP status.
	 */
	FLASH_OBProgramInitTypeDef obHandle;
	HAL_FLASHEx_OBGetConfig(&obHandle);
	rdpStatus = (uint8_t)obHandle.RDPLevel;
#else
	volatile uint32_t *pOBAddr = (uint32_t *)0x1FFFC000; /* Option byte addr */
	rdpStatus = (uint8_t)(*pOBAddr >> 8);	/* Extract bits[15:8] */
#endif
	
	return rdpStatus;
} /* End of Get_Flash_RDP_Level */

/**
 * Verify_Addr()
 * Brief	: Verifies the address sent by the host
 * Param	: @addr - Address sent by the host that is to be verified
 * Retval	: ADDR_VALID if the passed addr is valid, ADDR_INVALID otherwise
 * Note		: What are the valid address to which the code can jump?
 *			  - System memory: YES
 *			  - SRAM1: YES
 *			  - SRAM2: YES
 *			  - Backup SRAM: YES
 *			  - Peripheral memory: NO (Possible, but will not allow)
 *			  - External memory:	YES
 */
uint8_t Verify_Addr(uint32_t addr)
{
	if (SRAM1_BASE <= addr && addr <= SRAM1_END)
		return ADDR_VALID;
	else if (SRAM2_BASE <= addr && addr <= SRAM2_END)
		return ADDR_VALID;
	else if (FLASH_BASE <= addr && addr <= FLASH_END)
		return ADDR_VALID;
	else if (BKPSRAM_BASE <= addr && addr <= BKPSRAM_END)
		return ADDR_VALID;
	else
		return ADDR_INVALID;
} /* End of Verify_Addr */

/**
 * Execute_Flash_Erase()
 * Brief	: Performs Flash erase as per the passed arguments
 * Param	: @sectorNumber - The sector number (0-11) to erase or 0xFF to mass-
 *			  erase
 *			  @numberOfSectors - The number of sectors to erase 
 * Retval	: 0x00 (HAL_OK) if the erase was successful
 *			  0x01 (HAL_ERROR) if the erase was unsuccessful due to error
 *			  0x02 (HAL_BUSY) if the erase was unsuccessful due to busy state
 *			  0x03 (HAL_TIMEOUT) if the erase was unsuccessful due to timeout
 *			  0x04 (INVALID_NUM_OF_SECTORS) if the entered number of sectors to
 *				   erase was invalid
 * Note		: Main memory of the Flash module of the STM32F407xx MCUs consists
 *			  of 12 sectors (0-11). Therefore, @numberOfSectors should be in the
 *			  range of 1-12.
 *			  @sectorNumber 0xFF means 'mass-erase'.
 */
uint8_t Execute_Flash_Erase(uint8_t sectorNumber, uint8_t numberOfSectors)
{
	FLASH_EraseInitTypeDef flashEraseHandle;
	uint32_t sectorError;
	HAL_StatusTypeDef status;
	
	if (numberOfSectors > MAX_NUM_OF_SECTORS)
		return INVALID_NUM_OF_SECTORS;
	
	if ((sectorNumber == 0xFF) || (sectorNumber < MAX_NUM_OF_SECTORS))
	{
		if (sectorNumber == (uint8_t)0xFF)
		{
			/* Perform mass-erase */
			flashEraseHandle.TypeErase = FLASH_TYPEERASE_MASSERASE;
		}
		else
		{
			/* Perform sector-erase */
			
			/* Calculate how many sectors need to be erased */
			uint8_t remainingSectors = MAX_NUM_OF_SECTORS - sectorNumber;
			if (numberOfSectors > remainingSectors)
			{
				numberOfSectors = remainingSectors;
			}
			
			/* Populate the flashEraseHandle structure */
			flashEraseHandle.TypeErase = FLASH_TYPEERASE_SECTORS;
			flashEraseHandle.Sector = sectorNumber;	/* Initial sector */
			flashEraseHandle.NbSectors = numberOfSectors;
		}
		
		flashEraseHandle.Banks = FLASH_BANK_1;
		
		/* In order to access the Flash registers, unlock the flash first.
		 * ('Unlocking the Flash control register' of the MCU reference manual) 
		 */
		HAL_FLASH_Unlock();
		flashEraseHandle.VoltageRange = FLASH_VOLTAGE_RANGE_3;
		status = (uint8_t)HAL_FLASHEx_Erase(&flashEraseHandle, &sectorError);
		HAL_FLASH_Lock();
		
		return status;
	}
	
	return INVALID_NUM_OF_SECTORS;
} /* End of Execute_Flash_Erase */


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
